Revit 2024 API
BuiltInFailures.DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter Property
 Reporting parameters can only exist on a single dimension/constraint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MoreThanOneDimsLabelToOneReportingParameter { get; }
Visual Basic
Public Shared ReadOnly Property MoreThanOneDimsLabelToOneReportingParameter As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MoreThanOneDimsLabelToOneReportingParameter {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace